[{
"plantname": "Asparagus", 
"space": "12 to 18 inches wide and a full six inches deep. The crowns should be spaced 9 to 12 inches apart."
},
{
"plantname": "Bush Beans", 
"space": "2 to 4 inches apart in rows at least 18 to 24 inches apart."
},
{
"plantname": "Pole Beans", 
"space": "4 to 6 inches apart in rows 30 to 36 inches apart."
},
{
"plantname": "Beet", 
"space": "1/2 inch deep and one inch apart. Allow 12 to 18 inches between rows."
},
{
"plantname": "Broccoli", 
"space": "18 to 24 inches apart in the row and allow 36 inches between rows."
},
{
"plantname": "Brussels Sprouts", 
"space": "24 to 36 inches apart in the row, or 24 inches in all directions in beds."
},
{
"plantname": "Cabbage", 
"space": "12 to 24 inches apart in the row, 12 inches apart in all directions."
},
{
"plantname": "Carrot", 
"space": "12 to 24 inches apart in the row, 12 inches apart in all directions."
},
{
"plantname": "Cauliflower", 
"space": "18 to 24 inches apart in the row."
},
{
"plantname": "Celery", 
"space": "12 to 24 inches apart in the row, 12 inches apart in all directions."
},
{
"plantname": "Chard", 
"space": "1/2 to 3/4 inches deep (8 to 10 seeds per foot of row) Thin seedlings to 4 to 6 inches apart."
},
{
"plantname": "Collard", 
"space": "6 inches apart, allow them to grow until they begin to touch, then harvest whole plants to give 18 inches between plants."
},
{
"plantname": "Corn", 
"space": "Space the kernels 9 to 12 inches apart in the row. Allow 30 to 36 inches between rows"
},
{
"plantname": "Cucumber", 
"space": "one plant every 12 inches in the row."
},
{
"plantname": "Eggplant", 
"space": "18 to 24 inches apart in the row, allow 30 to 36 inches between rows or space plants 24 inches apart in all directions in raised beds."
},
{
"plantname": "Lettuce", 
"space": "1/4 to 1/2 inch deep (10 seeds per foot) in single, double or triple rows 12 to 18 inches apart."
},
{
"plantname": "Cantaloupe", 
"space": "18 to 24 inches apart, space rows at least 5 feet apart."
},
{
"plantname": "Mustard", 
"space": " 1/3 to 1/2 inch deep and thin seedlings to 3 to 5 inches apart."
},
{
"plantname": "Okra", 
"space": "1 inch deep, 12 to 24 inches apart."
},
{
"plantname": "Onion", 
"space": "4 to 5 inches apart in a row, allow 12 to 18 inches between rows or space onions 6 to 8 inches apart in all directions in beds."
},
{
"plantname": "Parsnip", 
"space": "seed thickly, at least two or three seeds per inch, space rows 18 to 24 inches apart or plants 8 to 10 inches apart in a bed."
},
{
"plantname": "Peas", 
"space": "1 to 1-1/2 inches deep and one inch apart in single or double rows. Allow 18 to 24 inches between single or pairs of rows. Allow 8 to 10 inches between double rows in pairs."
},
{
"plantname": "Peppers", 
"space": "18 to 24 inches apart in the row, or 14 to 18 inches apart in all directions in beds."
},
{
"plantname": "Potatoes", 
"space": "10 to 12 inches apart and cover in a furrow between 1 and 3 inches deep. Space rows 24 to 36 inches apart. The 24 inch spacing is often ideal."
},
{
"plantname": "Pumpkin", 
"space": "Requires a minimum of 50 to 100 square feet per hill. Plant seeds one inch deep (four or five seeds per hill). Allow 5 to 6 feet between hills, spaced in rows 10 to 15 feet apart."
},
{
"plantname": "Radishes", 
"space": "18 to 24 inches apart in a row, allow 30 to 36 inches between rows."
}]